<?php
return [
    'name' =>
    [
        'required' => 'يجب تقديم اسم.',
        'string' => 'يجب ان يكون الاسم نص.',
        'max' => 'يجب ان لا يزيد الاسم عن 255 حرف.',
    ],
    'username' =>
    [
        'required' => 'يجب تقديم اسم المستخدم.',
        'string' => 'يجب ان يكون اسم المستخدم نص.',
        'max' => 'يجب ان لا يزيد اسم المستخدم عن 255 حرف.',
        'unique' => 'اسم المستخدم موجود بالفعل.',
    ],
    'password' =>
    [
        'required' => 'يجب تقديم كلمة المرور.',
        'string' => 'يجب ان يكون كلمة المرور نص.',
        'min' => 'يجب ان لا تقل كلمة المرور عن 8 حروف.',
        'confirmed' => 'كلمة المرور غير متطابقة.',
    ],
    'role' =>
    [
        'required' => 'يجب تقديم نوع المستخدم.',
        'string' => 'يجب ان يكون نوع المستخدم نص.',
        'max' => 'يجب ان لا يزيد نوع المستخدم عن 255 حرف.',
        'in' => 'نوع المستخدم غير صحيح.',
    ],
];