<?php
return [
    'name' =>
    [
        'required' => 'من فضلك ادخل اسمك.',
        'string' => 'حقل الاسم يجب ان يكون نص.',
        'max' => 'حقل الاسم يجب ان لا يزيد عن 255 حرف.',
    ],
    'email' =>
    [
        'required' => 'من فضلك ادخل بريدك الالكتروني.',
        'string' => 'حقل البريد الالكتروني يجب ان يكون نص.',
        'email' => 'حقل البريد الالكتروني يجب ان يكون صحيح.',
        'max' => 'حقل البريد الالكتروني يجب ان لا يزيد عن 255 حرف.',
        'unique' => 'حقل البريد الالكتروني مستخدم بالفعل.',
    ],
    'phone' => [
        'required' => 'من فضلك ادخل رقم الهاتف.',
    ],
    'identity' =>
    [
        'required' => 'من فضلك ادخل نوع الهوية.',
    ],
    'birth_date' => [
        'required' => 'من فضلك ادخل تاريخ الميلاد.',
        'date' => 'صيغة التاريخ غير صحيحة.',
    ],
    'parent_email' =>
    [
        'required' => 'من فضلك ادخل بريدك الاب.',
        'string' => 'حقل البريد الاب يجب ان يكون نص.',
        'email' => 'حقل البريد الاب يجب ان يكون صحيح.',
        'max' => 'حقل البريد الاب يجب ان لا يزيد عن 255 حرف.',
    ],
    'password' =>
    [
        'required' => 'من فضلك ادخل كلمة المرور.',
        'string' => 'حقل كلمة المرور يجب ان يكون نص.',
        'min' => 'حقل كلمة المرور يجب ان لا تقل عن 8 حروف.',
        'confirmed' => 'حقل كلمة المرور غير متطابق.',
    ],
];