<?php
return [
    'name' =>
    [
        'required' => 'من فضلك ادخل اسمك.',
        'string' => 'الاسم يجب ان يكون نص.',
        'max' => 'الاسم يجب ان لا يزيد عن 255 حرف.',
    ],
    'email' =>
    [
        'required' => 'من فضلك ادخل بريدك الالكتروني.',
        'string' => 'البريد الالكتروني يجب ان يكون نص.',
        'email' => 'البريد الالكتروني يجب ان يكون صحيح.',
        'max' => 'البريد الالكتروني يجب ان لا يزيد عن 255 حرف.',
        'unique' => 'البريد الالكتروني مستخدم بالفعل.',
    ],
    'phone' => [
        'required' => 'من فضلك ادخل رقم الهاتف.',
        'unique' => 'رقم الهاتف مستخدم بالفعل.',
    ],
    'identity' =>
    [
        'required' => 'من فضلك ادخل نوع الهوية.',
        'unique' => 'رقم الهوية مستخدم بالفعل.',
    ],
    'birth_date' => [
        'required' => 'من فضلك ادخل تاريخ الميلاد.',
        'date' => 'صيغة التاريخ غير صحيحة.',
    ],
    'parent_email' =>
    [
        'required' => 'من فضلك ادخل البريد الإلكتروني لولي الأمر.',
        'string' => 'البريد الإلكتروني لولي الأمر يجب ان يكون نص.',
        'email' => 'البريد الإلكتروني لولي الأمر يجب ان يكون صحيح.',
        'max' => 'البريد الإلكتروني لولي الأمر يجب ان لا يزيد عن 255 حرف.',
    ],
    'password' =>
    [
        'required' => 'من فضلك ادخل كلمة المرور.',
        'string' => 'كلمة المرور يجب ان يكون نص.',
        'min' => 'كلمة المرور يجب ان لا تقل عن 8 حروف.',
        'confirmed' => 'كلمة المرور غير متطابق.',
    ],

    'startingLength' => [
        'phone' => 'رقم هاتف',
        'identity' => 'رقم هوية',
    ],
];